app/views/rounds/show.erb

<h1>Round <%= @round.game.rounds.size %> Results</h1>
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "rounds".* FROM "rounds" WHERE "rounds"."game_id" = ? ORDER BY "rounds"."id" DESC LIMIT ?  [["game_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "rounds" WHERE "rounds"."game_id" = ?  [["game_id", 2]]

<h2>Players:</h2>
<% @round.players.each do |player| %>
---
SELECT "players".* FROM "players" INNER JOIN "choices" ON "players"."id" = "choices"."player_id" WHERE "choices"."round_id" = ?  [["round_id", 2]]

  <%= player.name %><br>
  <% c = player.choices.find{|c| c.round_id == @round.id} %>
---
SELECT  "rounds".* FROM "rounds" WHERE "rounds"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "choices".* FROM "choices" WHERE "choices"."player_id" = ?  [["player_id", 28]]

<% @round.players.each do |player| %>
  <% if player.choices.find{|c| c.round_id == @round.id}.guess_ammount <= @round.item.price %>
---
SELECT  "items".* FROM "items" INNER JOIN "round_items" ON "items"."id" = "round_items"."item_id" WHERE "round_items"."round_id" = ? LIMIT ?  [["round_id", 2], ["LIMIT", 1]]