app/views/rounds/show.erb

SELECT COUNT(*) FROM "rounds" WHERE "rounds"."game_id" = ?  [["game_id", 2]]
---
  <p class="winner">Winner: <%= if !!@round.get_winner then @round.get_winner.name else 'No Winner This Round' end%>!!</p>
<% if @round.game.rounds.size < @round.game.num_rounds %>