app/views/games/final.erb

<% count = 1 %>
<% @game.rounds.each do |round| %>
---
SELECT "rounds".* FROM "rounds" WHERE "rounds"."game_id" = ?  [["game_id", 5]]

  <div>
  <% op = @game.players.order(wins: :desc) %>
---
SELECT "players".* FROM "players" WHERE "players"."game_id" = ? ORDER BY "players"."wins" DESC  [["game_id", 1]]