app/views/games/show.erb

SELECT  1 AS one FROM "players" WHERE "players"."game_id" = ? LIMIT ?  [["game_id", 2], ["LIMIT", 1]]
---

  <% if !@game.players.empty? %>

SELECT COUNT(*) FROM "rounds" WHERE "rounds"."game_id" = ?  [["game_id", 6]]
---

  <h3>Round <%= @game.rounds.size %></h3>