app/views/games/show.erb

  <h3>Players:</h3>
  <% @game.players.each do |player| %>
---
SELECT "players".* FROM "players" WHERE "players"."game_id" = ?  [["game_id", 1]]


  <h3>Round <%= @game.rounds.size %></h3>
---
SELECT  "rounds".* FROM "rounds" WHERE "rounds"."game_id" = ? ORDER BY "rounds"."id" DESC LIMIT ?  [["game_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "rounds" WHERE "rounds"."game_id" = ?  [["game_id", 3]]

  <p>Picture of Product</p>
  <%= image_tag @round.items.first.img_url%>
  <p>Name of Product</p>
  <%= @round.items.first.name %>
---
SELECT  "items".* FROM "items" INNER JOIN "round_items" ON "items"."id" = "round_items"."item_id" WHERE "round_items"."round_id" = ? LIMIT ?  [["round_id", 5], ["LIMIT", 1]]


  <% @game.players.each do |player| %>
---
SELECT "players".* FROM "players" WHERE "players"."game_id" = ?  [["game_id", 3]]

      <h4> <%= player.name %> </h4>
      <% if player.choices.find {|c| c.round_id == @round.id} %>
---
SELECT  "rounds".* FROM "rounds" WHERE "rounds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "choices".* FROM "choices" WHERE "choices"."player_id" = ?  [["player_id", 25]]


  <% if @game.players.map{|player| player.choices.find{|choice| choice.round_id == @round.id}}.select{|choice| !choice.nil?}.size == @game.players.size %>
---
SELECT "players".* FROM "players" WHERE "players"."game_id" = ?  [["game_id", 5]]