app/controllers/choices_controller.rb

SELECT  "rounds".* FROM "rounds" WHERE "rounds"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "choices".* FROM "choices" WHERE "choices"."round_id" = ?  [["round_id", 4]]
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "rounds".* FROM "rounds" WHERE "rounds"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "rounds".* FROM "rounds" WHERE "rounds"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "choices" ("round_id", "player_id", "guess_ammount") VALUES (?, ?, ?)  [["round_id", 4], ["player_id", 62], ["guess_ammount", 1]]
---
  def create
    #byebug
    if Round.find(params[:choice][:round_id]).choices.map{|c| c.guess_ammount}.include?(params[:choice][:guess_ammount].to_i)
      flash[:error] = 'Must Enter Unique Amount'
      redirect_to game_path(Round.find(params[:choice][:round_id]).game)
    elsif params[:choice][:guess_ammount].to_i <= 0
      flash[:error] = 'Must Enter Amount Above Zero'
      redirect_to game_path(Round.find(params[:choice][:round_id]).game)
    else
      @choice = Choice.create(choice_params)