app/controllers/games_controller.rb

  def create
    @game = Game.create(game_params)
    @game.room_code = (0...4).map {(65 +rand(26)).chr }.join
---
SELECT "games".* FROM "games"