app/controllers/games_controller.rb

  def show
    @game = Game.find(params[:id])
    if @game.finished
      redirect_to final_game_path(@game)
    else
      @round = @game.rounds.last
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "rounds".* FROM "rounds" WHERE "rounds"."game_id" = ? ORDER BY "rounds"."id" DESC LIMIT ?  [["game_id", 1], ["LIMIT", 1]]

  def final
    @game = Game.find(params[:id])
    @game.finished = true
    @game.save
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "games" SET "finished" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["finished", 1], ["updated_at", "2018-10-25 17:51:59.446414"], ["id", 2]]

  def create
    @game = Game.create(game_params)
    @game.room_code = @game.generate_room_code
    @game.started = false
    @game.finished = false
    @game.save
---
INSERT INTO "games" ("name", "created_at", "updated_at", "num_rounds") VALUES (?, ?, ?, ?)  [["name", "Germ"], ["created_at", "2018-10-25 18:00:47.658098"], ["updated_at", "2018-10-25 18:00:47.658098"], ["num_rounds", 2]]
INSERT INTO "games" ("name", "created_at", "updated_at", "num_rounds") VALUES (?, ?, ?, ?)  [["name", "Game"], ["created_at", "2018-10-25 19:21:10.262352"], ["updated_at", "2018-10-25 19:21:10.262352"], ["num_rounds", 2]]
UPDATE "games" SET "room_code" = ?, "updated_at" = ?, "started" = ?, "finished" = ? WHERE "games"."id" = ?  [["room_code", "FTLK"], ["updated_at", "2018-10-25 18:00:47.665721"], ["started", 0], ["finished", 0], ["id", 1]]

  def destroy
    # byebug
    @game = Game.find(params[:id])
    @game.destroy # TODO Not Destroying Everything :/
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 1]]