app/controllers/players_controller.rb

INSERT INTO "players" ("name", "game_id", "created_at", "updated_at", "room_code") VALUES (?, ?, ?, ?, ?)  [["name", "Max"], ["game_id", 1], ["created_at", "2018-10-25 18:32:08.716195"], ["updated_at", "2018-10-25 18:32:08.716195"], ["room_code", "FTLK"]]
---
  def create
    @player = Player.create(player_params)

SELECT  "games".* FROM "games" WHERE "games"."room_code" = ? LIMIT ?  [["room_code", "SSZH"], ["LIMIT", 1]]
---
  def player_params
    game = Game.find_by(room_code: params[:player][:room_code])