app/controllers/rounds_controller.rb

SELECT  "rounds".* FROM "rounds" WHERE "rounds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "rounds" SET "winner" = ? WHERE "rounds"."id" = ?  [["winner", 28], ["id", 2]]
INSERT INTO "rounds" ("game_id") VALUES (?)  [["game_id", 1]]
UPDATE "rounds" SET "winner" = ? WHERE "rounds"."id" = ?  [["winner", 65], ["id", 4]]
---
  def show
    @round = Round.find(params[:id])
    if tmp_winner = @round.find_winner
      @round.winner = tmp_winner.id
      tmp_winner.wins += 1
      tmp_winner.save
    else
      @round.winner = nil
    end
    @round.save

INSERT INTO "rounds" ("game_id") VALUES (?)  [["game_id", 2]]
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" INNER JOIN "round_items" ON "items"."id" = "round_items"."item_id" WHERE "round_items"."round_id" = ? LIMIT ?  [["round_id", 15], ["LIMIT", 1]]
SELECT  "rounds".* FROM "rounds" WHERE "rounds"."game_id" = ? ORDER BY "rounds"."id" ASC LIMIT ?  [["game_id", 8], ["LIMIT", 1]]
SELECT  "items".* FROM "items" INNER JOIN "round_items" ON "items"."id" = "round_items"."item_id" WHERE "round_items"."round_id" = ? LIMIT ?  [["round_id", 1], ["LIMIT", 1]]
INSERT INTO "round_items" ("round_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["round_id", 9], ["item_id", 420], ["created_at", "2018-10-26 18:21:08.756638"], ["updated_at", "2018-10-26 18:21:08.756638"]]
SELECT  "rounds".* FROM "rounds" WHERE "rounds"."game_id" = ? LIMIT ?  [["game_id", 8], ["LIMIT", 11]]
SELECT "items".* FROM "items"
INSERT INTO "round_items" ("round_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["round_id", 10], ["item_id", 415], ["created_at", "2018-10-26 18:21:14.910672"], ["updated_at", "2018-10-26 18:21:14.910672"]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 398], ["LIMIT", 1]]
SELECT  "rounds".* FROM "rounds" WHERE "rounds"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "games" SET "started" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["started", 1], ["updated_at", "2018-10-26 18:00:02.794122"], ["id", 8]]
---
  def create

    @round = Round.new
    @round.game_id = params[:game_id]
    @round.save

    ri = RoundItem.new
    ri.round_id = @round.id

    if !@round.game.rounds.first.item
      ri.item_id = Item.all.sample.id
      ri.save
    else
      ri.item_id = @round.find_uniq_item.id
      ri.save
    end

    game = Game.find(@round.game_id)

    if !game.started
      game.started = true
      game.save