app/controllers/rounds_controller.rb

  def create

    @round = Round.new
    @round.game_id = params[:game_id]
    @round.save

    ri = RoundItem.new
    ri.round_id = @round.id
    ri.item_id = Item.all.sample.id
    ri.save

    game = Game.find(@round.game_id)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]