app/models/game.rb

SELECT "games".* FROM "games"
---
  def generate_room_code
    code = (0...4).map{(65+rand(26)).chr}.join
    if Game.all.map{|game| game.room_code}.include? code

SELECT "choices".* FROM "choices" WHERE "choices"."player_id" = ?  [["player_id", 36]]
SELECT  "players".* FROM "players" WHERE "players"."game_id" = ? ORDER BY "players"."id" ASC LIMIT ?  [["game_id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "choices" WHERE "choices"."player_id" = ? LIMIT ?  [["player_id", 62], ["LIMIT", 1]]
SELECT  1 AS one FROM "players" WHERE "players"."game_id" = ? LIMIT ?  [["game_id", 2], ["LIMIT", 1]]
SELECT  "rounds".* FROM "rounds" WHERE "rounds"."game_id" = ? ORDER BY "rounds"."id" DESC LIMIT ?  [["game_id", 2], ["LIMIT", 1]]
SELECT "choices".* FROM "choices" WHERE "choices"."player_id" = ?  [["player_id", 62]]
SELECT "players".* FROM "players" WHERE "players"."game_id" = ?  [["game_id", 2]]
---
  def all_players_choices_are_in
    #byebug
    if self.players.exists? && self.players.first.choices.exists?
      self.players.map{|player| player.choices.find{|choice| choice.round_id == self.rounds.last.id}}.select{|choice| !choice.nil?}.size == self.players.size