app/models/player.rb

  def choice_for(round)
    self.choices.find{|c| c.round_id == round.id}
---
SELECT "choices".* FROM "choices" WHERE "choices"."player_id" = ?  [["player_id", 25]]