app/models/round.rb

  def find_uniq_item
    tmp_item = Item.all.sample
    if self.game.rounds.map{|r| r.item == tmp_item}.include? true
---
SELECT "items".* FROM "items"
SELECT  "items".* FROM "items" INNER JOIN "round_items" ON "items"."id" = "round_items"."item_id" WHERE "round_items"."round_id" = ? LIMIT ?  [["round_id", 1], ["LIMIT", 1]]
SELECT "rounds".* FROM "rounds" WHERE "rounds"."game_id" = ?  [["game_id", 1]]

  def get_winner
    if self.winner
      Player.find(self.winner)
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 84], ["LIMIT", 1]]

  def find_winner
    winner = nil
    self.players.each do |player|
---
SELECT "players".* FROM "players" INNER JOIN "choices" ON "players"."id" = "choices"."player_id" WHERE "choices"."round_id" = ?  [["round_id", 1]]